       01 WS-EMPLOYEES.
       05 WS-NAME       PIC A(20)    VALUE "JOHN DOE".
       05 WS-AGE        PIC 99       VALUE 30.
       05 WS-SALARY     PIC 9(5)V99  VALUE 55000.00.
       05 WS-DEPARTMENT PIC A(10)    VALUE "SALES".
    