       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.
       
       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       COPY haha.cpy.
       PROCEDURE DIVISION.

           DISPLAY "YOUR DETAILS: " WS-NAME.
           STOP RUN.
       END PROGRAM MAIN.
           